# Development Tools
brew "git"
brew "gh"
brew "go"
brew "python3"
brew "nvim"
brew "neovim"
brew "shfmt"
brew "black"
brew "git-delta"
brew "tldr"
brew "glow"
tap "cormacrelf/tap"
brew "cormacrelf/tap/dark-notify"
cask "visual-studio-code"

# System Utilities
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "curl"
brew "wget"
brew "parallel"
brew "watch"
brew "tree"
brew "htop"
brew "ncdu"
brew "lnav"
brew "topgrade"
brew "stow"
brew "bat"

# Shell & Navigation
brew "zsh"
brew "tmux"
brew "fzf"
brew "zoxide"
brew "fd"
brew "ripgrep"
brew "jq"
brew "jless"
brew "llm"

# Container & Cloud
brew "kubernetes-cli"
brew "helm"
brew "kubectx"
brew "krew"
brew "kind"
cask "docker"
brew "az"

# Desktop Applications
cask "alfred"
cask "ghostty"
cask "slack"
cask "spotify"
cask "plexamp"
cask "bartender"
cask "telegram"
cask "1password"
cask "discord"
cask "obsidian"
cask "home-assistant"
cask "monitorcontrol"
cask "meetingbar"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
