brew 'topgrade'
brew 'zsh-syntax-highlighting'
brew 'nvim'
brew 'stow'
brew 'coreutils'
brew 'cmake'
brew 'boost'
brew 'ctags-exuberant'
brew 'curl'
brew 'findutils'
brew 'git'
brew 'gnu-sed'
brew 'htop'
brew 'lnav'
brew 'moreutils'
brew 'mycli'
brew 'rename'
brew 'ripgrep'
brew 'tmux'
brew 'tree'
brew 'neovim'
brew 'wget'
brew 'z'
brew 'zsh'
brew 'az'

brew 'nodejs'
brew 'yarn'
brew 'postgres'
brew 'redis'
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'iterm2'
cask 'licecap'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'karabiner-elements'
