brew 'topgrade'
brew 'zsh-syntax-highlighting'
brew 'nvim'
brew 'stow'
brew 'coreutils'
brew 'cmake'
brew 'boost'
brew 'ctags-exuberant'
brew 'curl'
brew 'findutils'
brew 'git'
brew 'gnu-sed'
brew 'htop'
brew 'ncdu'
brew 'lnav'
brew 'moreutils'
brew 'mycli'
brew 'rename'
brew 'ripgrep'
brew 'tmux'
brew 'tree'
brew 'neovim'
brew 'wget'
brew 'z'
brew 'zsh'
brew 'az'
brew 'topgrade'

cask 'alfred'
cask 'docker'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'karabiner-elements'
cask 'bartender'
cask 'telegram'
cask '1password'
cask 'numi'
cask 'obsidian'
cask 'todoist'

tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'

